workstation/openfoam-master-tutorials/tutorials/compressible/overRhoPimpleDyMFoam/twoSimpleRotors/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(walls|outlet|inlet)"
    {
        type            zeroGradient;
    }

    hole
    {
        type            fixedValue;
        value           uniform 400;
    }

    overset
    {
        type            overset;
    }
}

// ************************************************************************* //
